{
    "jd": "The Opportunity\n\nJoin Adobe in the heart of Noida, where brand-new engineering meets outstanding innovation. As a Lead Data Engineer, you will play a pivotal role in crafting the future of Digital Media Analytics. This is an excellent chance to join a vibrant and driven team committed to improving a data system, data pipelines, reports, and analysis. Your work will be instrumental in delivering powerful technology that empowers users globally.\n\nWhat you will do\n\nCreate a data platform incorporating modern data processing and warehousing technologies. \nBuild, maintain, and ideate on frameworks and tools required to ingest, store, process and serve data for global scale, data-intensive systems. \nBuild data pipelines to publish reports and to power dashboards for Internal Sales Leadership and Operations teams. \nCollaborate with multi-functional teams to identify key interfaces for your projects and develop them with quality and agility. \nDo analysis and present key findings, insights and concepts to key influencers and leaders to help them make data driven decisions on business and product roadmap. \nSupport Machine Learning engineers and Data Scientists with their dataset needs for training the ML or statistical models and evaluating them. \nSupport Sales and Business Operations with datasets and insights\nBe aware of the latest open-source projects and technological breakthroughs in the data engineering space and explore them to build better and more effective solutions\nDrive innovation through research and experimentation, encouraging an environment where new ideas can thrive. \nMentor junior engineers on the team\n\nWhat you need to succeed\n\nA bachelor's degree in computer science or related fields and preferably a Masters Degree in computer science or related fields. \n8-12 years of experience in Data Engineering, consistently demonstrating the ability to build, implement, and deliver large scale, high-quality solutions. \nSolid understanding and programming skill in languages such as Java or Python and frameworks and libraries based on them with a focus on data engineering. \nExtensive experience and knowledge of a variety of data technologies and frameworks such as Delta Lake,, Datahub, Apache Spark, Azure Databricks. \nStrong familiarity with the concepts of RDBMS, Data Lake, Data Warehouse, Data Lakehouse, and Medallion Architecture. \nKnowledge of at least one workflow orchestration tools such as Airflow or Oozie. \nCollaborating with ML engineers, Data Scientists, product and engineering leadership on their data and analysis needs. \nExperience working with the DevOps teams to drive operationally excellent infrastructure. \nExcellent problem-solving skills, with a consistent track record of delivering innovative solutions. \nAbility to thrive in a collaborative, inclusive, and diverse workplace, embracing different perspectives and ideas. \nBeing comfortable with uncertainty and adapting to changing priorities. \nLead by example and mentor the team through detailed code and development reviews, hosting informative sessions, and demonstrating strong technical judgment in daily tasks. \nBeing ahead of the curve by familiarizing yourself with the latest and the best in the technological landscape and turning them into effective solutions for our customers."
}